tuananh1592/DoAnFinal1/Stm32Rigister.h

#ifndef STM32RIGISTER_H_
#define STM32RIGISTER_H_
#include <stdint.h>

typedef struct
{
    uint32_t CR;
    uint32_t CFGR;
    uint32_t CIR;
    uint16_t APB2RSTR;
    uint32_t APB1RSTR;
    uint32_t APBENR;
    uint32_t APB2ENR;
    uint32_t APB1ENR;
    uint32_t BDCR;
    uint32_t CSR;

} RCC_Type;
/* Define to access RCC peripheral registers */
#define RCC_BASE                    (0x40021000u)
#define RCC                         ((RCC_Type *)RCC_BASE)


/* EN IOPA*/
#define RCC_AHB2ENR_IOPAEN_SHIFT     (2u)
#define RCC_AHB2ENR_IOPAEN_MASK      (0x4u)
#define RCC_AHB2ENR_IOPAEN(x)        (((x) << RCC_AHB2ENR_IOPAEN_SHIFT) & (RCC_AHB2ENR_IOPAEN_MASK))
/* EN IOPA*/
/* EN IOPB*/
#define RCC_APB2ENR_IOPBEN_SHIFT    (3u)
#define RCC_APB2ENR_IOPBEN_MASK     (0x8u)
#define RCC_APB2ENR_IOPBEN(x)       (((x) << RCC_APB2ENR_IOPBEN_SHIFT) & (RCC_APB2ENR_IOPBEN_MASK))
/* EN IOPB*/
/* EN TIMER2*/
#define RCC_APB1ENR_TIM2EN_SHIFT    (0u)
#define RCC_APB1ENR_TIM2EN_MASK     (0x1u)
#define RCC_APB1ENR_TIM2EN(x)       (((x) << RCC_APB1ENR_TIM2EN_SHIFT) & (RCC_APB1ENR_TIM2EN_MASK))
/* EN TIMER2*/
/* EN TIMER3*/
#define RCC_APB1ENR_TIM3EN_SHIFT    (1u)
#define RCC_APB1ENR_TIM3EN_MASK     (0x2u)
#define RCC_APB1ENR_TIM3EN(x)       (((x) << RCC_APB1ENR_TIM3EN_SHIFT) & (RCC_APB1ENR_TIM3EN_MASK))
/* EN TIMER3*/
/* EN ADC1 */
#define RCC_AHB2ENR_ADC1_SHIFT     (9u)
#define RCC_AHB2ENR_ADC1_MASK      (0x200u)
#define RCC_AHB2ENR_ADC1(x)        (((x) << RCC_AHB2ENR_ADC1_SHIFT) & (RCC_AHB2ENR_ADC1_MASK))
/* EN ADC1 */
/* Define to access RCC peripheral registers */

typedef struct
{
	uint32_t CRL;
	uint32_t CRH;
	uint32_t IDR;
	uint32_t ODR;
	uint32_t BSRR;
	uint32_t BRR;
	uint32_t LCKR;
} GPIO_Type;
#define GPIOB_BASE                  (0x40010C00u)
#define GPIOB                       ((GPIO_Type *)GPIOB_BASE)



/* Define to access GPIOA peripheral registers */
#define GPIOA_BASE        (0x40010800u)
#define GPIOA             ((GPIO_Type *)GPIOA_BASE)

// ---------- PIN0 ----------
#define GPIOA_CRL_MODE0_SHIFT      (0u)
#define GPIOA_CRL_MODE0_MASK       (0x3u)
#define GPIOA_CRL_MODE0(x)         (((x)<<GPIOA_CRL_MODE0_SHIFT) & (GPIOA_CRL_MODE0_MASK))

#define GPIOA_CRL_CNF0_SHIFT       (2u)
#define GPIOA_CRL_CNF0_MASK        (0xCu)
#define GPIOA_CRL_CNF0(x)          (((x)<<GPIOA_CRL_CNF0_SHIFT) & (GPIOA_CRL_CNF0_MASK))

#define GPIOA_BSRR_BS0_SHIFT       (0u)
#define GPIOA_BSRR_BS0_MASK        (0x1u)
#define GPIOA_BSRR_BS0(x)          (((x)<<GPIOA_BSRR_BS0_SHIFT) & (GPIOA_BSRR_BS0_MASK))

#define GPIOA_BSRR_BR0_SHIFT       (16u)
#define GPIOA_BSRR_BR0_MASK        (0x10000u)
#define GPIOA_BSRR_BR0(x)          (((x)<<GPIOA_BSRR_BR0_SHIFT) & (GPIOA_BSRR_BR0_MASK))

// ---------- PIN1 ----------
#define GPIOA_CRL_MODE1_SHIFT      (4u)
#define GPIOA_CRL_MODE1_MASK       (0x30u)
#define GPIOA_CRL_MODE1(x)         (((x)<<GPIOA_CRL_MODE1_SHIFT) & (GPIOA_CRL_MODE1_MASK))

#define GPIOA_CRL_CNF1_SHIFT       (6u)
#define GPIOA_CRL_CNF1_MASK        (0xC0u)
#define GPIOA_CRL_CNF1(x)          (((x)<<GPIOA_CRL_CNF1_SHIFT) & (GPIOA_CRL_CNF1_MASK))

#define GPIOA_BSRR_BS1_SHIFT       (1u)
#define GPIOA_BSRR_BS1_MASK        (0x2u)
#define GPIOA_BSRR_BS1(x)          (((x)<<GPIOA_BSRR_BS1_SHIFT) & (GPIOA_BSRR_BS1_MASK))

#define GPIOA_BSRR_BR1_SHIFT       (17u)
#define GPIOA_BSRR_BR1_MASK        (0x20000u)
#define GPIOA_BSRR_BR1(x)          (((x)<<GPIOA_BSRR_BR1_SHIFT) & (GPIOA_BSRR_BR1_MASK))

// ---------- PIN2 ----------
#define GPIOA_CRL_MODE2_SHIFT      (8u)
#define GPIOA_CRL_MODE2_MASK       (0x300u)
#define GPIOA_CRL_MODE2(x)         (((x)<<GPIOA_CRL_MODE2_SHIFT) & (GPIOA_CRL_MODE2_MASK))

#define GPIOA_CRL_CNF2_SHIFT       (10u)
#define GPIOA_CRL_CNF2_MASK        (0xC00u)
#define GPIOA_CRL_CNF2(x)          (((x)<<GPIOA_CRL_CNF2_SHIFT) & (GPIOA_CRL_CNF2_MASK))

#define GPIOA_BSRR_BS2_SHIFT       (2u)
#define GPIOA_BSRR_BS2_MASK        (0x4u)
#define GPIOA_BSRR_BS2(x)          (((x)<<GPIOA_BSRR_BS2_SHIFT) & (GPIOA_BSRR_BS2_MASK))

#define GPIOA_BSRR_BR2_SHIFT       (18u)
#define GPIOA_BSRR_BR2_MASK        (0x40000u)
#define GPIOA_BSRR_BR2(x)          (((x)<<GPIOA_BSRR_BR2_SHIFT) & (GPIOA_BSRR_BR2_MASK))

// ---------- PIN3 ----------
#define GPIOA_CRL_MODE3_SHIFT      (12u)
#define GPIOA_CRL_MODE3_MASK       (0x3000u)
#define GPIOA_CRL_MODE3(x)         (((x)<<GPIOA_CRL_MODE3_SHIFT) & (GPIOA_CRL_MODE3_MASK))

#define GPIOA_CRL_CNF3_SHIFT       (14u)
#define GPIOA_CRL_CNF3_MASK        (0xC000u)
#define GPIOA_CRL_CNF3(x)          (((x)<<GPIOA_CRL_CNF3_SHIFT) & (GPIOA_CRL_CNF3_MASK))

#define GPIOA_BSRR_BS3_SHIFT       (3u)
#define GPIOA_BSRR_BS3_MASK        (0x8u)
#define GPIOA_BSRR_BS3(x)          (((x)<<GPIOA_BSRR_BS3_SHIFT) & (GPIOA_BSRR_BS3_MASK))

#define GPIOA_BSRR_BR3_SHIFT       (19u)
#define GPIOA_BSRR_BR3_MASK        (0x80000u)
#define GPIOA_BSRR_BR3(x)          (((x)<<GPIOA_BSRR_BR3_SHIFT) & (GPIOA_BSRR_BR3_MASK))

// ---------- PIN4 ----------
#define GPIOA_CRL_MODE4_SHIFT      (16u)
#define GPIOA_CRL_MODE4_MASK       (0x30000u)
#define GPIOA_CRL_MODE4(x)         (((x)<<GPIOA_CRL_MODE4_SHIFT) & (GPIOA_CRL_MODE4_MASK))

#define GPIOA_CRL_CNF4_SHIFT       (18u)
#define GPIOA_CRL_CNF4_MASK        (0xC0000u)
#define GPIOA_CRL_CNF4(x)          (((x)<<GPIOA_CRL_CNF4_SHIFT) & (GPIOA_CRL_CNF4_MASK))

#define GPIOA_BSRR_BS4_SHIFT       (4u)
#define GPIOA_BSRR_BS4_MASK        (0x10u)
#define GPIOA_BSRR_BS4(x)          (((x)<<GPIOA_BSRR_BS4_SHIFT) & (GPIOA_BSRR_BS4_MASK))

#define GPIOA_BSRR_BR4_SHIFT       (20u)
#define GPIOA_BSRR_BR4_MASK        (0x100000u)
#define GPIOA_BSRR_BR4(x)          (((x)<<GPIOA_BSRR_BR4_SHIFT) & (GPIOA_BSRR_BR4_MASK))

// ---------- PIN5 ----------
#define GPIOA_CRL_MODE5_SHIFT      (20u)
#define GPIOA_CRL_MODE5_MASK       (0x300000u)
#define GPIOA_CRL_MODE5(x)         (((x)<<GPIOA_CRL_MODE5_SHIFT) & (GPIOA_CRL_MODE5_MASK))

#define GPIOA_CRL_CNF5_SHIFT       (22u)
#define GPIOA_CRL_CNF5_MASK        (0xC00000u)
#define GPIOA_CRL_CNF5(x)          (((x)<<GPIOA_CRL_CNF5_SHIFT) & (GPIOA_CRL_CNF5_MASK))

#define GPIOA_BSRR_BS5_SHIFT       (5u)
#define GPIOA_BSRR_BS5_MASK        (0x20u)
#define GPIOA_BSRR_BS5(x)          (((x)<<GPIOA_BSRR_BS5_SHIFT) & (GPIOA_BSRR_BS5_MASK))

#define GPIOA_BSRR_BR5_SHIFT       (21u)
#define GPIOA_BSRR_BR5_MASK        (0x200000u)
#define GPIOA_BSRR_BR5(x)          (((x)<<GPIOA_BSRR_BR5_SHIFT) & (GPIOA_BSRR_BR5_MASK))

