tuananh1592/DoAnFinal1/Stm32Rigister.h
#define GPIOB_IDR0_SHIFT (0u)
#define GPIOB_IDR0_MASK  (0x1u << GPIOB_IDR0_SHIFT)
#define GPIOB_IDR0(x)    (((x) << GPIOB_IDR0_SHIFT) & GPIOB_IDR0_MASK)

// ---------- PIN1 ----------
#define GPIOB_CRL_MODE1_SHIFT      (4u)
#define GPIOB_CRL_MODE1_MASK       (0x30u)
#define GPIOB_CRL_MODE1(x)         (((x)<<GPIOB_CRL_MODE1_SHIFT) & (GPIOB_CRL_MODE1_MASK))

#define GPIOB_CRL_CNF1_SHIFT       (6u)
#define GPIOB_CRL_CNF1_MASK        (0xC0u)
#define GPIOB_CRL_CNF1(x)          (((x)<<GPIOB_CRL_CNF1_SHIFT) & (GPIOB_CRL_CNF1_MASK))

#define GPIOB_BSRR_BS1_SHIFT       (1u)
#define GPIOB_BSRR_BS1_MASK        (0x2u)
#define GPIOB_BSRR_BS1(x)          (((x)<<GPIOB_BSRR_BS1_SHIFT) & (GPIOB_BSRR_BS1_MASK))

#define GPIOB_BSRR_BR1_SHIFT       (17u)
#define GPIOB_BSRR_BR1_MASK        (0x20000u)
#define GPIOB_BSRR_BR1(x)          (((x)<<GPIOB_BSRR_BR1_SHIFT) & (GPIOB_BSRR_BR1_MASK))

// ---------- PIN3 ----------
#define GPIOB_CRL_MODE3_SHIFT      (12u)
#define GPIOB_CRL_MODE3_MASK       (0x3000u)
#define GPIOB_CRL_MODE3(x)         (((x)<<GPIOB_CRL_MODE3_SHIFT) & (GPIOB_CRL_MODE3_MASK))

#define GPIOB_CRL_CNF3_SHIFT       (14u)
#define GPIOB_CRL_CNF3_MASK        (0xC000u)
#define GPIOB_CRL_CNF3(x)          (((x)<<GPIOB_CRL_CNF3_SHIFT) & (GPIOB_CRL_CNF3_MASK))

#define GPIOB_BSRR_BS3_SHIFT       (3u)
#define GPIOB_BSRR_BS3_MASK        (0x8u)
#define GPIOB_BSRR_BS3(x)          (((x)<<GPIOB_BSRR_BS3_SHIFT) & (GPIOB_BSRR_BS3_MASK))

#define GPIOB_BSRR_BR3_SHIFT       (19u)
#define GPIOB_BSRR_BR3_MASK        (0x80000u)
#define GPIOB_BSRR_BR3(x)          (((x)<<GPIOB_BSRR_BR3_SHIFT) & (GPIOB_BSRR_BR3_MASK))

// ---------- PIN4 ----------
#define GPIOB_CRL_MODE4_SHIFT      (16u)
#define GPIOB_CRL_MODE4_MASK       (0x30000u)
#define GPIOB_CRL_MODE4(x)         (((x)<<GPIOB_CRL_MODE4_SHIFT) & (GPIOB_CRL_MODE4_MASK))

#define GPIOB_CRL_CNF4_SHIFT       (18u)
#define GPIOB_CRL_CNF4_MASK        (0xC0000u)
#define GPIOB_CRL_CNF4(x)          (((x)<<GPIOB_CRL_CNF4_SHIFT) & (GPIOB_CRL_CNF4_MASK))

#define GPIOB_BSRR_BS4_SHIFT       (4u)
#define GPIOB_BSRR_BS4_MASK        (0x10u)
#define GPIOB_BSRR_BS4(x)          (((x)<<GPIOB_BSRR_BS4_SHIFT) & (GPIOB_BSRR_BS4_MASK))

#define GPIOB_BSRR_BR4_SHIFT       (20u)
#define GPIOB_BSRR_BR4_MASK        (0x100000u)
#define GPIOB_BSRR_BR4(x)          (((x)<<GPIOB_BSRR_BR4_SHIFT) & (GPIOB_BSRR_BR4_MASK))

// ---------- PIN6 ----------
#define GPIOB_CRL_MODE6_SHIFT      (24u)
#define GPIOB_CRL_MODE6_MASK       (0x3000000u)
#define GPIOB_CRL_MODE6(x)         (((x)<<GPIOB_CRL_MODE6_SHIFT) & (GPIOB_CRL_MODE6_MASK))

#define GPIOB_CRL_CNF6_SHIFT       (26u)
#define GPIOB_CRL_CNF6_MASK        (0xC000000u)
#define GPIOB_CRL_CNF6(x)          (((x)<<GPIOB_CRL_CNF6_SHIFT) & (GPIOB_CRL_CNF6_MASK))

#define GPIOB_BSRR_BS6_SHIFT       (6u)
#define GPIOB_BSRR_BS6_MASK        (0x40u)
#define GPIOB_BSRR_BS6(x)          (((x)<<GPIOB_BSRR_BS6_SHIFT) & (GPIOB_BSRR_BS6_MASK))

#define GPIOB_BSRR_BR6_SHIFT       (22u)
#define GPIOB_BSRR_BR6_MASK        (0x400000u)
#define GPIOB_BSRR_BR6(x)          (((x)<<GPIOB_BSRR_BR6_SHIFT) & (GPIOB_BSRR_BR6_MASK))

// ---------- PIN7 ----------
#define GPIOB_CRL_MODE7_SHIFT      (28u)
#define GPIOB_CRL_MODE7_MASK       (0x30000000u)
#define GPIOB_CRL_MODE7(x)         (((x)<<GPIOB_CRL_MODE7_SHIFT) & (GPIOB_CRL_MODE7_MASK))

#define GPIOB_CRL_CNF7_SHIFT       (30u)
#define GPIOB_CRL_CNF7_MASK        (0xC0000000u)
#define GPIOB_CRL_CNF7(x)          (((x)<<GPIOB_CRL_CNF7_SHIFT) & (GPIOB_CRL_CNF7_MASK))

#define GPIOB_BSRR_BS7_SHIFT       (7u)
#define GPIOB_BSRR_BS7_MASK        (0x80u)
#define GPIOB_BSRR_BS7(x)          (((x)<<GPIOB_BSRR_BS7_SHIFT) & (GPIOB_BSRR_BS7_MASK))

#define GPIOB_BSRR_BR7_SHIFT       (23u)
#define GPIOB_BSRR_BR7_MASK        (0x800000u)
#define GPIOB_BSRR_BR7(x)          (((x)<<GPIOB_BSRR_BR7_SHIFT) & (GPIOB_BSRR_BR7_MASK))
// ---------- PIN8 ----------
#define GPIOB_CRH_MODE8_SHIFT      (0u) // bit bat dau
#define GPIOB_CRH_MODE8_MASK       (0x3u) // Onl bit 0 1
#define GPIOB_CRH_MODE8(x)         (((x)<<GPIOB_CRH_MODE8_SHIFT) & (GPIOB_CRH_MODE8_MASK))

#define GPIOB_CRH_CNF8_SHIFT       (2u)
#define GPIOB_CRH_CNF8_MASK        (0xCu) // Onl bit 2 3
#define GPIOB_CRH_CNF8(x)          (((x)<<GPIOB_CRH_CNF8_SHIFT) & (GPIOB_CRH_CNF8_MASK))

#define GPIOB_BSRR_BS8_SHIFT       (8u)
#define GPIOB_BSRR_BS8_MASK        (0x100u) // Onl bit 8
#define GPIOB_BSRR_BS8(x)          (((x)<<GPIOB_BSRR_BS8_SHIFT) & (GPIOB_BSRR_BS8_MASK))

#define GPIOB_BSRR_BR8_SHIFT       (24u) // bit bat dau
#define GPIOB_BSRR_BR8_MASK        (0x1000000u) // Onl bit 24
#define GPIOB_BSRR_BR8(x)          (((x)<<GPIOB_BSRR_BR8_SHIFT) & (GPIOB_BSRR_BR8_MASK))

// ---------- PIN9 ----------
#define GPIOB_CRH_MODE9_SHIFT      (4u) // bit bat dau
#define GPIOB_CRH_MODE9_MASK       (0x30u) // Onl bit 4 5
#define GPIOB_CRH_MODE9(x)         (((x)<<GPIOB_CRH_MODE9_SHIFT) & (GPIOB_CRH_MODE9_MASK))

#define GPIOB_CRH_CNF9_SHIFT       (6u)
#define GPIOB_CRH_CNF9_MASK        (0xC0u) // Onl bit 6 7
#define GPIOB_CRH_CNF9(x)          (((x)<<GPIOB_CRH_CNF9_SHIFT) & (GPIOB_CRH_CNF9_MASK))

#define GPIOB_BSRR_BS9_SHIFT       (9u)
#define GPIOB_BSRR_BS9_MASK        (0x200u) // Onl bit 9
#define GPIOB_BSRR_BS9(x)          (((x)<<GPIOB_BSRR_BS9_SHIFT) & (GPIOB_BSRR_BS9_MASK))

#define GPIOB_BSRR_BR9_SHIFT       (25u) // bit bat dau
#define GPIOB_BSRR_BR9_MASK        (0x2000000u) // Onl bit 25
#define GPIOB_BSRR_BR9(x)          (((x)<<GPIOB_BSRR_BR9_SHIFT) & (GPIOB_BSRR_BR9_MASK))

// ---------- PIN12 ----------
#define GPIOB_CRH_MODE12_SHIFT      (16u)
#define GPIOB_CRH_MODE12_MASK       (0x3u << GPIOB_CRH_MODE12_SHIFT)
#define GPIOB_CRH_MODE12(x)         (((x) << GPIOB_CRH_MODE12_SHIFT) & GPIOB_CRH_MODE12_MASK)

#define GPIOB_CRH_CNF12_SHIFT       (18u)
#define GPIOB_CRH_CNF12_MASK        (0x3u << GPIOB_CRH_CNF12_SHIFT)
#define GPIOB_CRH_CNF12(x)          (((x) << GPIOB_CRH_CNF12_SHIFT) & GPIOB_CRH_CNF12_MASK)

#define GPIOB_BSRR_BS12_SHIFT       (12u)
#define GPIOB_BSRR_BS12_MASK        (0x1u << GPIOB_BSRR_BS12_SHIFT)
#define GPIOB_BSRR_BS12(x)          (((x) << GPIOB_BSRR_BS12_SHIFT) & GPIOB_BSRR_BS12_MASK)

