tuananh1592/DoAnFinal1/Stm32Rigister.h
#define GPIOB_BSRR_BR12_SHIFT       (28u)
#define GPIOB_BSRR_BR12_MASK        (0x1u << GPIOB_BSRR_BR12_SHIFT)
#define GPIOB_BSRR_BR12(x)          (((x) << GPIOB_BSRR_BR12_SHIFT) & GPIOB_BSRR_BR12_MASK)

// ---------- PIN13 ----------
#define GPIOB_CRH_MODE13_SHIFT      (20u)
#define GPIOB_CRH_MODE13_MASK       (0x3u << GPIOB_CRH_MODE13_SHIFT)
#define GPIOB_CRH_MODE13(x)         (((x) << GPIOB_CRH_MODE13_SHIFT) & GPIOB_CRH_MODE13_MASK)

#define GPIOB_CRH_CNF13_SHIFT       (22u)
#define GPIOB_CRH_CNF13_MASK        (0x3u << GPIOB_CRH_CNF13_SHIFT)
#define GPIOB_CRH_CNF13(x)          (((x) << GPIOB_CRH_CNF13_SHIFT) & GPIOB_CRH_CNF13_MASK)

#define GPIOB_BSRR_BS13_SHIFT       (13u)
#define GPIOB_BSRR_BS13_MASK        (0x1u << GPIOB_BSRR_BS13_SHIFT)
#define GPIOB_BSRR_BS13(x)          (((x) << GPIOB_BSRR_BS13_SHIFT) & GPIOB_BSRR_BS13_MASK)

#define GPIOB_BSRR_BR13_SHIFT       (29u)
#define GPIOB_BSRR_BR13_MASK        (0x1u << GPIOB_BSRR_BR13_SHIFT)
#define GPIOB_BSRR_BR13(x)          (((x) << GPIOB_BSRR_BR13_SHIFT) & GPIOB_BSRR_BR13_MASK)

// ---------- PIN14 ----------
#define GPIOB_CRH_MODE14_SHIFT      (24u)
#define GPIOB_CRH_MODE14_MASK       (0x3u << GPIOB_CRH_MODE14_SHIFT)
#define GPIOB_CRH_MODE14(x)         (((x) << GPIOB_CRH_MODE14_SHIFT) & GPIOB_CRH_MODE14_MASK)

#define GPIOB_CRH_CNF14_SHIFT       (26u)
#define GPIOB_CRH_CNF14_MASK        (0x3u << GPIOB_CRH_CNF14_SHIFT)
#define GPIOB_CRH_CNF14(x)          (((x) << GPIOB_CRH_CNF14_SHIFT) & GPIOB_CRH_CNF14_MASK)

#define GPIOB_BSRR_BS14_SHIFT       (14u)
#define GPIOB_BSRR_BS14_MASK        (0x1u << GPIOB_BSRR_BS14_SHIFT)
#define GPIOB_BSRR_BS14(x)          (((x) << GPIOB_BSRR_BS14_SHIFT) & GPIOB_BSRR_BS14_MASK)

#define GPIOB_BSRR_BR14_SHIFT       (30u)
#define GPIOB_BSRR_BR14_MASK        (0x1u << GPIOB_BSRR_BR14_SHIFT)
#define GPIOB_BSRR_BR14(x)          (((x) << GPIOB_BSRR_BR14_SHIFT) & GPIOB_BSRR_BR14_MASK)

// ---------- PIN15 ----------
#define GPIOB_CRH_MODE15_SHIFT      (28u)
#define GPIOB_CRH_MODE15_MASK       (0x3u << GPIOB_CRH_MODE15_SHIFT)
#define GPIOB_CRH_MODE15(x)         (((x) << GPIOB_CRH_MODE15_SHIFT) & GPIOB_CRH_MODE15_MASK)

#define GPIOB_CRH_CNF15_SHIFT       (30u)
#define GPIOB_CRH_CNF15_MASK        (0x3u << GPIOB_CRH_CNF15_SHIFT)
#define GPIOB_CRH_CNF15(x)          (((x) << GPIOB_CRH_CNF15_SHIFT) & GPIOB_CRH_CNF15_MASK)

#define GPIOB_BSRR_BS15_SHIFT       (15u)
#define GPIOB_BSRR_BS15_MASK        (0x1u << GPIOB_BSRR_BS15_SHIFT)
#define GPIOB_BSRR_BS15(x)          (((x) << GPIOB_BSRR_BS15_SHIFT) & GPIOB_BSRR_BS15_MASK)

#define GPIOB_BSRR_BR15_SHIFT       (31u)
#define GPIOB_BSRR_BR15_MASK        (0x1u << GPIOB_BSRR_BR15_SHIFT)
#define GPIOB_BSRR_BR15(x)          (((x) << GPIOB_BSRR_BR15_SHIFT) & GPIOB_BSRR_BR15_MASK)
/* Define to access GPIOB peripheral registers */

typedef struct
{
    uint32_t CR1;
    uint32_t CR2;
    uint32_t SMCR;
    uint32_t DIER;
    uint32_t SR;
    uint32_t EGR;
    uint32_t CCMR1;
    uint32_t CCMR2;
    uint32_t CCER;
    uint32_t CNT;
    uint32_t PSC;
    uint32_t ARR;
    uint32_t RESERVED_1;
    uint32_t CCR1;
    uint32_t CCR2;
    uint32_t CCR3;
    uint32_t CCR4;
    uint32_t RESERVED_2;
    uint32_t DCR;
    uint32_t DMAR;
} TIM_Type;
/* TIMER2 */
#define TIM2_BASE                   (0x40000000u)
#define TIM2                        ((TIM_Type *)TIM2_BASE)

#define TIM_CR1_CEN_SHIFT           (0u)
#define TIM_CR1_CEN_MASK            (0x1u)
#define TIM_CR1_CEN(x)              (((x) << TIM_CR1_CEN_SHIFT) & (TIM_CR1_CEN_MASK))

#define TIM_PSC_PSC_SHIFT           (0u)
#define TIM_PSC_PSC_MASK            (0xFFFFu)
#define TIM_PSC_PSC(x)               (((x) << TIM_PSC_PSC_SHIFT) & (TIM_PSC_PSC_MASK))

#define TIM_ARR_ARR_SHIFT           (0u)
#define TIM_ARR_ARR_MASK            (0xFFFFu)
#define TIM_ARR_ARR(x)              (((x) << TIM_ARR_ARR_SHIFT) & (TIM_ARR_ARR_MASK))
/* TIMER2 */

/* TIMER3 */
#define TIM3_BASE                   (0x40000400u)
#define TIM3                        ((TIM_Type *)TIM3_BASE)

#define TIM3_CR1_CEN_SHIFT          (0u)
#define TIM3_CR1_CEN_MASK           (0x1u)
#define TIM3_CR1_CEN(x)             (((x) << TIM3_CR1_CEN_SHIFT) & (TIM3_CR1_CEN_MASK))

#define TIM3_PSC_PSC_SHIFT          (0u)
#define TIM3_PSC_PSC_MASK           (0xFFFFu)
#define TIM3_PSC_PSC(x)             (((x) << TIM3_PSC_PSC_SHIFT) & (TIM3_PSC_PSC_MASK))

#define TIM3_ARR_ARR_SHIFT          (0u)
#define TIM3_ARR_ARR_MASK           (0xFFFFu)
#define TIM3_ARR_ARR(x)             (((x) << TIM3_ARR_ARR_SHIFT) & (TIM3_ARR_ARR_MASK))
/* TIMER3 */


typedef struct{
	uint32_t SR;
	uint32_t CR1;
	uint32_t CR2;
	uint32_t SMPR1;
	uint32_t SMPR2;
	uint32_t JOFRx;
	uint32_t HTR;
	uint32_t LTR;
	uint32_t SQR1;
	uint32_t SQR2;
	uint32_t SQR3;
	uint32_t JSQR;
	uint32_t JDRx;
	uint32_t DR;

}ADC_Type;

#define ADC_BASE (0x40012400u)
#define ADC		 ((ADC_Type *) ADC_BASE) //cai nay minh chua hieu sau lam

#define ADC_CR2_ADON_SHIFT (0u)
#define ADC_CR2_ADON_MASK  (0x1u)
#define ADC_CR2_ADON(x) 	(((x)<<ADC_CR2_ADON_SHIFT) & (ADC_CR2_ADON_MASK) )

#define ADC_CR2_CONT_SHIFT (1u)
#define ADC_CR2_CONT_MASK  (0x2u)
#define ADC_CR2_CONT(x) 	(((x)<<ADC_CR2_CONT_SHIFT) & (ADC_CR2_CONT_MASK) )

#define ADC_CR2_CAL_SHIFT (2u)
#define ADC_CR2_CAL_MASK  (0x4u)
#define ADC_CR2_CAL(x) 	(((x)<<ADC_CR2_CAL_SHIFT) & (ADC_CR2_CAL_MASK) )

#define ADC_SQR3_SQ0_SHIFT (0u)
#define ADC_SQR3_SQ0_MASK  (0x1u)
#define ADC_SQR3_SQ0(x) 	(((x)<<ADC_SQR3_SQ0_SHIFT) & (ADC_SQR3_SQ0_MASK) )

#define ADC_CR2_SWSTART_SHIFT (22u)
#define ADC_CR2_SWSTART_MASK  (0x400000u)
#define ADC_CR2_SWSTART(x) 	(((x)<<ADC_CR2_SWSTART_SHIFT) & (ADC_CR2_SWSTART_MASK) )

#define ADC_SR_EOC_SHIFT (1u)
#define ADC_SR_EOC_MASK  (0x2u)
#define ADC_SR_EOC(x) 	(((x)<<ADC_SR_EOC_SHIFT) & (ADC_SR_EOC_MASK))

#define ADC_DR_DATA_SHIFT (0u)
#define ADC_DR_DATA_MASK  (0x1u)
#define ADC_DR_DATA(x) 	  (((x)<<ADC_DR_DATA_SHIFT) & (ADC_DR_DATA_MASK) )


#endif /* STM32RIGISTER_H_ */
